OdIfc.Utils.getSubItemsByType(OdSmartPtr&lt;OdDAI.ApplicationInstance&gt;!System.Runtime.CompilerServices.IsConst,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves subitems identifiers of current IfcElement on decompose or connective relationship with specified type.
\param instance [in] A pointer to IFC application instance.
\param subItemType [in] OdAnsiString that contains subitem types to extract.
\returns OdDAIObjectIds, array of OdDAIObjectId instances, which contain subitems identifiers or empty array otherwise.

OdIfc.Utils.getSubItems(OdSmartPtr&lt;OdDAI.ApplicationInstance&gt;!System.Runtime.CompilerServices.IsConst)
\details
Retrieves subitems identifiers of current IfcElement based on decompose or connective relationship.
\param instance [in] A pointer to IFC application instance.
\returns OdDAIObjectIds, array of OdDAIObjectId instances, which contain subitems identifiers or empty array otherwise.